# GetCustomObjSecPath

## Description
Returns a handle to the second path polygon of a path custom object.

```pascal
FUNCTION GetCustomObjSecPath(objectHand : HANDLE): HANDLE;
```

```python
def vs.GetCustomObjSecPath(objectHand):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Handle to object.|

## See Also
VS Functions:
GetCustomObjectPath

## Version
Availability: from Vectorworks 2023.3

## Category
* Objects - Custom